read_liberty -lib ../../stdCelllib/gscl45nm.lib
read -sv ./vFiles/*v
hierarchy -top BoomCore
flatten
synth -top BoomCore
flatten

# the high-level stuff
proc; fsm; opt; memory; opt
clean

# mapping flip-flops to mycells.lib
dfflibmap -liberty ../../stdCelllib/gscl45nm.lib
clean

# mapping logic to mycells.lib
abc  -liberty ../../stdCelllib/gscl45nm.lib

clean
opt
opt
clean
clean
clean

write_blif boom.blif
