read_liberty -lib ../../stdCelllib/gscl45nm.lib
read -sv ./vFiles/*v
hierarchy -top TilePRCIDomain
flatten
synth -top TilePRCIDomain
flatten

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty ../../stdCelllib/gscl45nm.lib

# mapping logic to mycells.lib
abc  -liberty ../../stdCelllib/gscl45nm.lib

clean
opt
clean

write_blif rocket.blif
